# Add Homebrew taps
tap "charmbracelet/tap"

# Infra utils
brew "kubectl"
brew "opentofu"
brew "awscli"
brew "k9s"

# Coding utils
brew "go"
brew "godoc"
brew "neovim"
brew "jq"
brew "yq"

# Shell utils
brew "starship"
brew "zoxide"
brew "tldr"
brew "thefuck"
brew "eza"
brew "ripgrep"
brew "duf"
brew "gdu"
brew "bat"
brew "fzf"


# ZSH customization
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Taps
## Charm
brew "charmbracelet/tap/freeze"

# PeopleInc
brew "npm"
brew "java"
brew "btop"

# Install cask utils
cask "font-hack-nerd-font"
cask "gcloud-cli"
