# Add Homebrew taps

# Infra utils
brew "kubectl"
brew "opentofu"
brew "awscli"
brew "k9s"

# Coding utils
brew "go"
brew "neovim"
brew "jq"
brew "yq"

# Shell utils
brew "starship"
brew "zoxide"
brew "tldr"
brew "thefuck"
brew "eza"
brew "ripgrep"
brew "duf"
brew "gdu"
brew "bat"
brew "fzf"

# Install cask utils
cask "font-hack-nerd-font"
